module.exports.config = {
  'name': "autotime",
  'version': "10.02",
  'hasPermssion': 0x0,
  'credits': "𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨",
  'description': "সেট করা সময় অনুযায়ী স্বয়ংক্রিয়ভাবে বার্তাগুলি পাঠানো হবে!",
  'commandCategory': "group messenger",
  'usages': '[]',
  'cooldowns': 0x3
};
const nam = [
  {
    'timer': "12:00:00 AM",
    'message': ["🕚 11:00 PM\n\n১১টা বাজে...শান্ত রাত, ফোনটা রেখে একটু চাঁদের দিকে তাকাও। 🌙\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "1:00:00 AM", 
    'message': ["🕛 12:00 AM\n\nএখন রাত ১২টা! কার কার এখনো ঘুম আসেনি, আর কারা এখনো crush কে text দিচ্ছে? 🤨\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "2:00:00 AM",
    'message': ["🕐 1:00 AM\n\nএখন রাত ১টা, ঘুমোতে যাও আর না হলে আমাকে সঙ্গ দাও! 😴📱\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "3:00:00 AM",
    'message': ["🕑 2:00 AM\n\nএখন রাত ২টা! যারা Hacker হইতে চাও, এখন সময় পিএইচপি শেখার! 🤓👨‍💻\nহয় স্কিল ডেভেলপমেন্ট এ ফোকাস করো নাহলে সাউন্ড স্লীপ এ যাও। 😇\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "4:00:00 AM",
    'message': ["🕒 3:00 AM\n\nএখন ৩টা বাজে, অলরেডি ভূতের ডিউটি শুরু হইসে 👻 কেউ online থাকলে Voot FM টা চালিয়ে দাও। 😂\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "5:00:00 AM",
    'message': ["🕓 4:00 AM\n\nএখন রাত ৪টা! কারা কারা এখনো ছাদে দাঁড়িয়ে ভাবতেসো \"জীবন মানেই দুঃখ\"? 😅\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "6:00:00 AM",
    'message': ["🕔 5:00 AM\n\nএখন ৫টা বাজে, ফজরের আযান হয়তো শুরু হয়ে গেছে। উঠ, চল ভাই নামাজে চল! 🕌\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "7:00:00 AM",
    'message': ["🕕 6:00 AM\n\nভোর ৬টা, রোদের আলো দেখতে দেখতে একটা নতুন দিনের শুরু। হিন্দু ভাই-বোনেরা সূর্য প্রণাম করে দিন শুরু করেন! মুসলমান ভাই-বোনদের ঘুম ভাঙছে তো? 🌄\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "8:00:00 AM",
    'message': ["🕖 7:00 AM\n\nএখন সকাল ৭টা, দাঁত মাজো, মুখ ধুয়ে আজকের টার্গেট ঠিক করে ফেলো! 💪📅\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "9:00:00 AM",
    'message': ["🕗 8:00 AM\n\n৮টা বাজে, আজকের সকালটা হোক একদম fresh & productive! 🌞\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "10:00:00 AM",
    'message': ["🕘 9:00 AM\n\n৯টা বাজে! পড়তে বসো না হলে ভবিষ্যতে বউ-এর সামনে লজ্জা পাবে! 🤭\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "11:00:00 AM",
    'message': ["🕙 10:00 AM\n\nএখন ১০টা, ব্রেন একদম একটিভ! এখনই time আইডিয়া execute করার! 🔥\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "12:00:00 PM",
    'message': ["🕚 11:00 AM\n\n১১টা বাজে, এখনো ঘুমাচ্ছো? এইভাবে entrepreneur হওয়া যাবে না ভাই! 😴🚫\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "1:00:00 PM",
    'message': ["🕛 12:00 PM\n\nএখন দুপুর ১২টা! Lunch break, stomach এর RAM full করো! 🍛🧠\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "2:00:00 PM",
    'message': ["🕐 1:00 PM\n\n১টা বাজে, দুপুরের ঘুম vs কাজ – তুমি কোনটা বেছে নেবে? 😴💼\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "3:00:00 PM",
    'message': ["🕑 2:00 PM\n\n২টা বাজে, চোখ ভারি হয়ে আসছে? একটু বিশ্রাম নিয়ে আবার শুরু করো! 😪💤\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "4:00:00 PM",
    'message': ["🕒 3:00 PM\n\n৩টা বাজে, কেউ ঘুমায়, কেউ লাইভে যায়, তুমি কী করতেছো? 📸\nকিছু না করলে চলো আড্ডা দেই!😇\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "5:00:00 PM",
    'message': ["🕓 4:00 PM\n\n৪টা বাজে, এখন এক কাপ চা হলে জমে যেত! ☕️ কে কে আমার সাথে একমত?\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "6:00:00 PM",
    'message': ["🕔 5:00 PM\n\n৫টা বাজে, বিকেল হইছে! একবার ছাদে গিয়ে sunset দেখো! 🌇\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "7:00:00 PM",
    'message': ["🕕 6:00 PM\n\n৬টা বাজে, আজকের দিনটা কেমন গেলো? মেসেজ দাও আমি শুনবো। 📝\nহিন্দু ভাই-বোনেরা সন্ধ্যা আহ্নিকের জন্য প্রস্তুত হন।\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "8:00:00 PM",
    'message': ["🕖 7:00 PM\n\n৭টা বাজে! দিন শেষ হওয়ার আগে আজ কিছু ভালো কাজ করো। 🫶\nযাও নামাজ টা পড়ে আসো!💝\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "9:00:00 PM",
    'message': ["🕗 8:00 PM\n\n৮টা বাজে, ডিনার টাইম 🍽️ পেট পূর্ণ থাকলে মনও ভালো থাকে!\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "10:00:00 PM",
    'message': ["🕘 9:00 PM\n\n৯টা বাজে, একটু পড়ো, নিজের উপর বিনিয়োগ সব থেকে লাভজনক। 📚\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  },
  {
    'timer': "11:00:00 PM",
    'message': ["🕙 10:00 PM\n\n১০টা বাজে! এক কাপ দুধ খেয়ে ঘুমোতে যাও, স্বপ্নে আমি থাকবো। 😌🥛\n💬💻🚀𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨"]
  }];
module.exports.onLoad = _0x51a72a => setInterval(() => {
  if (á = nam.find(_0x32e72f => _0x32e72f.timer == new Date(Date.now() + 25200000).toLocaleString().split(/,/).pop().trim())) {
    global.data.allThreadID.forEach(_0x438dac => _0x51a72a.api.sendMessage(á.message[Math.floor(Math.random() * á.message.length)], _0x438dac));
  }
}, 1000);
module.exports.run = _0x49e04b => {};
