module.exports.config = {
  'name': "prayer",
  'version': "2.0",
  'hasPermssion': 0x0,
  'credits': "Chitron Bhattacharjee",
  'description': "সেট করা সময় অনুযায়ী স্বয়ংক্রিয়ভাবে বার্তাগুলি পাঠানো হবে!",
  'commandCategory': "AutoTime",
  'countDown': 0x3
};
module.exports.onLoad = async ({
  api: _0x4cee77
}) => {
  const _0x1aa5fa = {
    "05:35 AM": {
      'message': ". ╭•┄┅══❁🌺❁══┅┄•╮\n•—»✨ফযরের আযান✨«—•\n ╰•┄┅══❁🕋❁══┅┄•╯\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আসসালামু আলাইকুম-!!🖤💫\n প্রিয় মুসলিম ভাই ও বোনেরা, এখন ফযরের আযান দেওয়া হয়েছে। সবাই নামাজের জন্য প্রস্তুতি নিন।\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\nɴᴇxᴛ ᴘʀᴀʏᴇʀ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ💝\nᴘʀᴀʏᴇʀ ɴᴀᴍᴇ: সূর্য প্রণাম\nᴘʀᴀʏᴇʀ ᴛɪᴍᴇ: সকাল ৬:০০ টা\nᴘʀᴀʏᴇʀ ᴄᴀᴛᴇɢᴏʀʏ: হিন্দু\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆"
    },
    "06:00 AM": {
      'message': ". ╭•┄┅══❁🌺❁══┅┄•╮\n•—»✨সূর্য প্রণাম✨«—•\n ╰•┄┅══❁🛕❁══┅┄•╯\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n নমস্কার-!!🖤💫\n প্রিয় হিন্দু ভাই ও বোনেরা, এখন সকাল ৬টা, সূর্য দেবের প্রণাম করার সময়।\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\nɴᴇxᴛ ᴘʀᴀʏᴇʀ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ💝\nᴘʀᴀʏᴇʀ ɴᴀᴍᴇ: যুহর\nᴘʀᴀʏᴇʀ ᴛɪᴍᴇ: দুপুর ১:০০ টা\nᴘʀᴀʏᴇʀ ᴄᴀᴛᴇɢᴏʀʏ: ইসলাম\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆"
    },
    "01:00 PM": {
      'message': ". ╭•┄┅══❁🌺❁══┅┄•╮\n•—»✨যুহরের আযান✨«—•\n ╰•┄┅══❁🕋❁══┅┄•╯\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আসসালামু আলাইকুম-!!🖤💫\n প্রিয় মুসলিম ভাই ও বোনেরা, এখন যুহরের আযান দেওয়া হয়েছে। সবাই নামাজের জন্য প্রস্তুতি নিন।\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\nɴᴇxᴛ ᴘʀᴀʏᴇʀ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ💝\nᴘʀᴀʏᴇʀ ɴᴀᴍᴇ: আসর\nᴘʀᴀʏᴇʀ ᴛɪᴍᴇ: বিকাল ৪:৩০ টা\nᴘʀᴀʏᴇʀ ᴄᴀᴛᴇɢᴏʀʏ: ইসলাম\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆"
    },
    "04:30 PM": {
      'message': ". ╭•┄┅══❁🌺❁══┅┄•╮\n•—»✨আসরের আযান✨«—•\n ╰•┄┅══❁🕋❁══┅┄•╯\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আসসালামু আলাইকুম-!!🖤💫\n প্রিয় মুসলিম ভাই ও বোনেরা, এখন আসরের আযান দেওয়া হয়েছে। সবাই নামাজের জন্য প্রস্তুতি নিন।\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\nɴᴇxᴛ ᴘʀᴀʏᴇʀ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ💝\nᴘʀᴀʏᴇʀ ɴᴀᴍᴇ: ত্রিসন্ধ্যা আহ্নিক\nᴘʀᴀʏᴇʀ ᴛɪᴍᴇ: সন্ধ্যা ৬:০০ টা\nᴘʀᴀʏᴇʀ ᴄᴀᴛᴇɢᴏʀʏ: হিন্দু\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆"
    },
    "06:00 PM": {
      'message': ". ╭•┄┅══❁🌺❁══┅┄•╮\n•—»✨ত্রিসন্ধ্যা আহ্নিক✨«—•\n ╰•┄┅══❁🛕❁══┅┄•╯\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n নমস্কার-!!🖤💫\n প্রিয় হিন্দু ভাই ও বোনেরা, এখন সন্ধ্যা ৬টা, ত্রিসন্ধ্যা আহ্নিক করার সময়।\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\nɴᴇxᴛ ᴘʀᴀʏᴇʀ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ💝\nᴘʀᴀʏᴇʀ ɴᴀᴍᴇ: মাগরিব\nᴘʀᴀʏᴇʀ ᴛɪᴍᴇ: সন্ধ্যা ৭:০৫ টা\nᴘʀᴀʏᴇʀ ᴄᴀᴛᴇɢᴏʀʏ: ইসলাম\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆"
    },
    "07:05 PM": {
      'message': ". ╭•┄┅══❁🌺❁══┅┄•╮\n•—»✨মাগরিবের আযান✨«—•\n ╰•┄┅══❁🕋❁══┅┄•╯\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আসসালামু আলাইকুম-!!🖤💫\n প্রিয় মুসলিম ভাই ও বোনেরা, এখন মাগরিবের আযান দেওয়া হয়েছে। সবাই নামাজের জন্য প্রস্তুতি নিন।\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\nɴᴇxᴛ ᴘʀᴀʏᴇʀ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ💝\nᴘʀᴀʏᴇʀ ɴᴀᴍᴇ: ইশা\nᴘʀᴀʏᴇʀ ᴛɪᴍᴇ: রাত ৮:১৫ টা\nᴘʀᴀʏᴇʀ ᴄᴀᴛᴇɢᴏʀʏ: ইসলাম\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆"
    },
    "08:15 PM": {
      'message': "╭•┄┅══❁🌺❁══┅┄•╮\n•—»✨ইশার আযান✨«—•\n╰•┄┅══❁🕋❁══┅┄•╯\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n আসসালামু আলাইকুম-!!🖤💫\n প্রিয় মুসলিম ভাই ও বোনেরা, এখন ইশার আযান দেওয়া হয়েছে। সবাই নামাজের জন্য প্রস্তুতি নিন।\n\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\nɴᴇxᴛ ᴘʀᴀʏᴇʀ ɪɴꜰᴏʀᴍᴀᴛɪᴏɴ💝\nᴘʀᴀʏᴇʀ ɴᴀᴍᴇ: ফযর\nᴘʀᴀʏᴇʀ ᴛɪᴍᴇ: ভোর ৫:৩৫ টা\nᴘʀᴀʏᴇʀ ᴄᴀᴛᴇɢᴏʀʏ: ইসলাম\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆\n𝐒𝐡𝐢𝐏𝐮 𝐀𝐢 🤖💨\n⋆✦⋆⎯⎯⎯⎯⎯⎯⎯⎯⎯⋆✦⋆"
    }
  };
  const _0x5c48f9 = async () => {
    const _0x81b199 = new Date(Date.now() + 21600000).toLocaleTimeString("en-US", {
      'hour': "2-digit",
      'minute': "2-digit",
      'hour12': true
    }).split(',').pop().trim();
    if (_0x1aa5fa[_0x81b199]) {
      console.log(_0x1aa5fa[_0x81b199].message);
      try {
        let _0x43ee23 = {
          'body': _0x1aa5fa[_0x81b199].message
        };
        global.data.allThreadID.forEach(_0x30683f => _0x4cee77.sendMessage(_0x43ee23, _0x30683f));
      } catch (_0x1a816f) {
        console.error("Failed to send message for time " + _0x81b199 + ':', _0x1a816f);
      }
    }
    setTimeout(_0x5c48f9, 45000);
  };
  _0x5c48f9();
};
module.exports.run = ({}) => {};
